---   
 <img align="left" width="75" height="75"  src="https://upload.wikimedia.org/wikipedia/en/c/c8/University_of_the_Punjab_logo.png"> 

<h1 align="center">Department of Data Science</h1>
<h1 align="center">Course: Tools and Techniques for Data Science</h1>

---
<h3><div align="right">Instructor: Muhammad Arif Butt, Ph.D.</div></h3>

<h1 align="center">Lecture 3.21 (Pandas-13)</h1>

## _Merging and Joining Dataframes.ipynb_

## Learning agenda of this notebook

1. Need of Merging and Types of Joins
2. Merging DataFrames using `pd.merge()` method
   - Perform **Inner Join** (which is default)
   - Peform **Outer**/**Full Outer Join**
   - Perform **Left Outer Join**
   - Perform **Right Outer Join**
3. Additional Parameters to `pd.merge()` Method  
   - Use of `indicator` parameter to indicate the df to which the value belong
   - Use of `suffixes` parameter to differentiate between common column labels
   - Use of `validate` parameter to check for duplicate keys

## 1. Need of Merging and Types of Joins
- Merging or joining data is basically a concept very commonly used in relational databases. 
- Pandas have options for high-performance in-memory merging and joining using `pd.merge()` and `df.join()` methods
- There are four basic ways to handle the join (`inner`, `left`, `right`, and `outer`), depending on which rows must retain their data.

<img align="right" width="200" height="200"  src="images/merge1.png"  >

### Inner  Join:
>It is the most common type of join you’ll be working with. It returns a dataframe with only those rows that have common characteristics.
An inner join requires each row in the two joined dataframes to have matching column values. This is similar to the intersection of two sets.

<img align="right" width="200" height="200"  src="images/merge2.png"  >

### Full Outer Join:
>Also known as Full Join, returns all those records which either have a match in the left or right dataframe. This is similar to the union of two sets.

<img align="right" width="200" height="200"  src="images/merge3.png"  >

###  Left outer Join
>Also known as Left join. It is simply performs an inner join plus all the non-matching rows of the left dataframe are taken as it is filled with NaN for columns of the right dataframe.

<img align="right" width="200" height="200"  src="images/merge4.png"  >

### Right outer Join
>Also known as Right join. It is simply performs an inner join plus  all the non-matching rows of the right dataframe are taken as it is filled with NaN for columns of the left dataframe.

## 2. Merging DataFrames using `pd.merge()` Method
Pandas `pd.merge()` is a versatile method to perform all standard database join operations between DataFrame or named Series objects.

```
pd.merge(left, right, how="inner", indicator=False, on=None, suffixes=("_x", "_y"), validate=None)
```
Where,
- **`left`:** A DataFrame or named Series object.
- **`right`:** Another DataFrame or named Series object.
- **`how`:** specifies the type of join {`inner`, `outer`, `left`, `right`}
- **`indicator`:** If set to True, adds a column to the output DataFrame called _merge with information on the source of each row {`left_only` means, this element is present only in left Dataframe, `right_only` means this is present only in right dataframe, `both` means they are present in both
- **`on`:** Column or index level names to join on. Must be found in both the left and right DataFrame and/or Series objects. 
- **`suffixes`:** A tuple of string suffixes to apply to overlapping columns. Defaults to ('_x', '_y').
- **`validate`:** string, default None. If specified, checks if merge is of specified type.
    - “one_to_one” or “1:1”: checks if merge keys are unique in both left and right datasets.
    - “one_to_many” or “1:m”: checks if merge keys are unique in left dataset.
    - “many_to_one” or “m:1”: checks if merge keys are unique in right dataset.
    - “many_to_many” or “m:m”: allowed, but does not result in checks.

### Need to Merge Dataframes
- Consider two dataframes:
    - df1 containing temperature of different cities
    - df2 containing humidity of those cities
- Let us merge these two dataframes based on **cities** as their **key**
- The merge function actually looks into the city column instead of checking indexes only and join dataframes on the basis of it

In [1]:
# Let us create a simple data frame
import pandas as pd

df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
})
df1

        city  temperature
0     Lahore           35
1    Karachi           39
2   Peshawer           33
3  Islamabad           29
4      Muree           15

In [2]:
import pandas as pd

df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'humidity' : [76, 95, 72, 81, 70],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2   Peshawer        72
3  Islamabad        81
4      Muree        70

In [3]:
df1, df2

(        city  temperature
 0     Lahore           35
 1    Karachi           39
 2   Peshawer           33
 3  Islamabad           29
 4      Muree           15,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2   Peshawer        72
 3  Islamabad        81
 4      Muree        70)

**Note the column `city` on which we want to perform an inner join, in the two dataframes has all cities cities in common. So the resulting dataframe has same number of rows as the two input dataframes**

In [4]:
# By default the merge perform an inner join, even if we do not metion the parameter `how`
d1 = pd.merge(df1, df2, on='city')
d1

        city  temperature  humidity
0     Lahore           35        76
1    Karachi           39        95
2   Peshawer           33        72
3  Islamabad           29        81
4      Muree           15        70

<img align="right" width="200" height="200"  src="images/merge1.png"  >

### a. Inner  Join:
It is the most common type of join you’ll be working with. It returns a dataframe with only those rows that have common characteristics.
An inner join requires each row in the two joined dataframes to have matching column values. This is similar to the intersection of two sets.

In [5]:
# Let us create a simple data frame
import pandas as pd

# This dataframe doesn't have entry for Lahore
df1 = pd.DataFrame({
    'city': ['Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [39, 33, 29, 15],
})
df1

        city  temperature
0    Karachi           39
1   Peshawer           33
2  Islamabad           29
3      Muree           15

In [6]:
import pandas as pd

# This Dataframe has an extra entry for Multan
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Multan'],
    'humidity' : [76, 95, 72, 81, 70, 75],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2   Peshawer        72
3  Islamabad        81
4      Muree        70
5     Multan        75

In [7]:
df1, df2

(        city  temperature
 0    Karachi           39
 1   Peshawer           33
 2  Islamabad           29
 3      Muree           15,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2   Peshawer        72
 3  Islamabad        81
 4      Muree        70
 5     Multan        75)

**Note the column `city` on which we want to perform an inner join, in the two dataframes has only four cities in common. So the resulting dataframe will have only four rows that are common in both dataframes**

In [8]:
# merge will perform only for those cities that are common in both, which means it by-default performs inner-join
d1 = pd.merge(df1, df2, on='city', how = 'inner')
d1

        city  temperature  humidity
0    Karachi           39        95
1   Peshawer           33        72
2  Islamabad           29        81
3      Muree           15        70

<img align="right" width="200" height="200"  src="images/merge2.png"  >

### b. Full Outer Join:
>Also known as Full Join, returns all those records which either have a match in the left or right dataframe. This is similar to the union of two sets.

In [9]:
# Let us create a simple data frame
import pandas as pd

# This dataframe has Sialkot instead of Lahore
df1 = pd.DataFrame({
    'city': ['Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Sialkot'],
    'temperature' : [39, 33, 29, 15, 40],
})
df1

        city  temperature
0    Karachi           39
1   Peshawer           33
2  Islamabad           29
3      Muree           15
4    Sialkot           40

In [10]:
import pandas as pd

# This Dataframe has an extra entry for Multan
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Multan'],
    'humidity' : [76, 95, 72, 81, 70, 75],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2   Peshawer        72
3  Islamabad        81
4      Muree        70
5     Multan        75

In [11]:
df1, df2

(        city  temperature
 0    Karachi           39
 1   Peshawer           33
 2  Islamabad           29
 3      Muree           15
 4    Sialkot           40,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2   Peshawer        72
 3  Islamabad        81
 4      Muree        70
 5     Multan        75)

**Note the column `city` on which we want to perform a full outer join, in the two dataframes has a union of  seven cities. So the resulting dataframe will have seven rows**

In [12]:
# By setting the 'how' Parameter, you can specify to perform outer join, which perform set Union
# it lefts null values for the columns it doesn't have information

# merge will perform only for those cities that are common in both, which means it by-default performs inner-join
d2 = pd.merge(df1, df2, on='city', how='outer')
d2

        city  temperature  humidity
0    Karachi         39.0      95.0
1   Peshawer         33.0      72.0
2  Islamabad         29.0      81.0
3      Muree         15.0      70.0
4    Sialkot         40.0       NaN
5     Lahore          NaN      76.0
6     Multan          NaN      75.0

<img align="right" width="200" height="200"  src="images/merge3.png"  >

###  c. Left outer Join
Also known as Left join. It is simply performs an inner join plus all the non-matching rows of the left dataframe are taken as it is filled with NaN for columns of the right dataframe.

In [13]:
# Let us create a simple data frame
import pandas as pd

# This dataframe has Sialkot instead of Lahore
df1 = pd.DataFrame({
    'city': ['Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Sialkot'],
    'temperature' : [39, 33, 29, 15, 40],
})
df1

        city  temperature
0    Karachi           39
1   Peshawer           33
2  Islamabad           29
3      Muree           15
4    Sialkot           40

In [14]:
import pandas as pd

# This Dataframe has an extra entry for Multan
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Multan'],
    'humidity' : [76, 95, 72, 81, 70, 75],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2   Peshawer        72
3  Islamabad        81
4      Muree        70
5     Multan        75

In [15]:
df1, df2

(        city  temperature
 0    Karachi           39
 1   Peshawer           33
 2  Islamabad           29
 3      Muree           15
 4    Sialkot           40,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2   Peshawer        72
 3  Islamabad        81
 4      Muree        70
 5     Multan        75)

**Note the column `city` on which we want to perform a left outer join, in the two dataframes has an intersection of four rows. Other than these four rows, record of city Sialkot from left dataframe will also be included in the resulting dataframe being a left outer join**

In [16]:
# In left outer join, it takes all the rows from left dataframe and only common rows from right dataframe
# You can specify the left outer join using 'how' parameter

d3 = pd.merge(df1, df2, on='city', how='left')
d3

        city  temperature  humidity
0    Karachi           39      95.0
1   Peshawer           33      72.0
2  Islamabad           29      81.0
3      Muree           15      70.0
4    Sialkot           40       NaN

<img align="right" width="200" height="200"  src="images/merge4.png"  >

### d. Right outer Join
Also known as Right join. It is simply performs an inner join plus  all the non-matching rows of the right dataframe are taken as it is filled with NaN for columns of the left dataframe.

In [17]:
# Let us create a simple data frame
import pandas as pd

# This dataframe has Sialkot instead of Lahore
df1 = pd.DataFrame({
    'city': ['Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Sialkot'],
    'temperature' : [39, 33, 29, 15, 40],
})
df1

        city  temperature
0    Karachi           39
1   Peshawer           33
2  Islamabad           29
3      Muree           15
4    Sialkot           40

In [18]:
import pandas as pd

# This Dataframe has an extra entry for Multan
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree', 'Multan'],
    'humidity' : [76, 95, 72, 81, 70, 75],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2   Peshawer        72
3  Islamabad        81
4      Muree        70
5     Multan        75

In [19]:
df1, df2

(        city  temperature
 0    Karachi           39
 1   Peshawer           33
 2  Islamabad           29
 3      Muree           15
 4    Sialkot           40,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2   Peshawer        72
 3  Islamabad        81
 4      Muree        70
 5     Multan        75)

**Note the column `city` on which we want to perform a right outer join, in the two dataframes has an intersection of four rows. Other than these four rows, record of city Multan from right dataframe will also be included in the resulting dataframe being a left outer join**

In [20]:
# In Right outer join, it takes all the rows from Right dataframe and only common rows from left dataframe
# You can specify the right outer join using 'how' parameter

df3 = pd.merge(df1, df2, on='city', how='right')
df3

        city  temperature  humidity
0     Lahore          NaN        76
1    Karachi         39.0        95
2   Peshawer         33.0        72
3  Islamabad         29.0        81
4      Muree         15.0        70
5     Multan          NaN        75

**Left and right outer join also depend on the order of Dataframes that are passed to merge() function. Let us change the order and understand this**

In [21]:
df4 = pd.merge(df2, df1, on='city', how='right')
df4

        city  humidity  temperature
0    Karachi      95.0           39
1   Peshawer      72.0           33
2  Islamabad      81.0           29
3      Muree      70.0           15
4    Sialkot       NaN           40

## 3. Additional Parameters to `pd.merge()` Method

### Use of `indicator=True` Parameter
- Sometimes you want to know, from which dataframe these elements are coming, you can check this by passing the `indicator=True` parameter to `pd.merge()` method. 
- This gives you an additional column in the output DataFrame called **`_merge`** with information on the source of each row 
    - `left_only` means, this element is present only in left Dataframe, 
    - `right_only` means this is present only in right dataframe, 
    - `both` means they are present in both

In [22]:
df3 = pd.merge(df1, df2, on='city', how='outer', indicator=True)
df3

        city  temperature  humidity      _merge
0    Karachi         39.0      95.0        both
1   Peshawer         33.0      72.0        both
2  Islamabad         29.0      81.0        both
3      Muree         15.0      70.0        both
4    Sialkot         40.0       NaN   left_only
5     Lahore          NaN      76.0  right_only
6     Multan          NaN      75.0  right_only

###  Use of `suffixes` Parameter
- When you merge dataframes having columns with same labels, other than the one on which you are joining ('city`)
- The resulting dataframe will have appended suffixes (`_x`, `_y`) with column labels to differentiate b/w columns of both dataframes
- For better understanding you can pass `suffixes`.....
- Let us understand this by example

In [23]:
import pandas as pd

df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer'],
    'temperature' : [35, 39, 33],
    'humidity' : [76, 95, 72]
})

df1

       city  temperature  humidity
0    Lahore           35        76
1   Karachi           39        95
2  Peshawer           33        72

In [24]:
import pandas as pd
df2 = pd.DataFrame({
    'city': [ 'Karachi', 'Peshawer', 'Islamabad'],
    'temperature' : [41, 44, 47],
    'humidity' : [88, 99, 79]
})
df2

        city  temperature  humidity
0    Karachi           41        88
1   Peshawer           44        99
2  Islamabad           47        79

In [25]:
df3 = pd.merge(df1, df2, on='city')
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0   Karachi             39          95             41          88
1  Peshawer             33          72             44          99

- **You can check that merge has automatically appended suffixes with column labels to differentiate b/w columns of both dataframes**
- **You can use the `suffixes` parameter to `pd.merge()` method to specify the suffixes other than `_x` and `_y` to something more meaningful.**

In [26]:
d3 = pd.merge(df1, df2, on='city', suffixes=('_left','_right'))
d3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,Karachi,39,95,41,88
1,Peshawer,33,72,44,99

###  Use `validate` Parameter to Check for Duplicate Keys
- We can use the `validate` parameter to the `pd.merge()` method to check for uniqueness of keys. This parameter can take following four values (default is None):
    - “one_to_one” or “1:1”: checks if merge keys are unique in both left and right datasets.
    - “one_to_many” or “1:m”: checks if merge keys are unique in left dataset.
    - “many_to_one” or “m:1”: checks if merge keys are unique in right dataset.
    - “many_to_many” or “m:m”: allowed, but does not result in checks.

In [27]:
# We are going to merge on `city`, which is unique in this dataframe
import pandas as pd
df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Muree'],
    'temperature' : [35, 39, 15],
})
df1

      city  temperature
0   Lahore           35
1  Karachi           39
2    Muree           15

In [28]:
# We are going to merge on `city`, which is NOT unique in this dataframe (appearing twice)
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Islamabad', 'Lahore'],
    'humidity' : [76, 95, 72, 76],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2  Islamabad        72
3     Lahore        76

In [29]:
# one_to_one requires the merge key (city column) to be unique in both df1 and df2, if not then throw execption
#pd.merge(df1, df2, on='city', validate='one_to_one')

In [30]:
# one_to_many requires the merge key (city column) to be unique in left datyaframe df1, if not then throw execption
pd.merge(df1, df2, on='city', validate='one_to_many')

      city  temperature  humidity
0   Lahore           35        76
1   Lahore           35        76
2  Karachi           39        95

In [31]:
# meny_to_one requires the merge key to be unique in right dataframe df2, if not then throw exception
#pd.merge(df1, df2, on='city', validate='many_to_one')

**Students can also explore the `df.join()` method at their own, although the `pd.merge()` method is more versstile and is preferred by programmers**